test.xml

<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns=\"http://www.cigna.com/ecr/individual/location/individualbenefits/7/\" xmlns:ns1=\"http://www.cigna.com/individual/benefits/locatebenefits/bi/7/\" xmlns:ns2=\"http://www.cigna.com/individual/benefits/request/types/1/\" xmlns:ns3=\"http://www.cigna.com/individual/shared/7/\">\n    <soapenv:Header>\n        <wsse:Security soapenv:mustUnderstand=\"0\" xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\">\n            <wsse:UsernameToken>\n                <wsse:Username>{{SI_ID}}</wsse:Username>\n                <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText\">{{SI_PW}}</wsse:Password>\n            </wsse:UsernameToken>\n        </wsse:Security>\n        <rh:requestHeader xmlns:rh=\"http://www.cigna.com/utility/1/\">\n            <rh:serviceReferenceId/>\n            <rh:functionalContext>\n                <rh:consumerName>CSA-EASConsumer</rh:consumerName>\n                <rh:userPrincipal>\n                    <rh:userId>UNAUTHENTICATED</rh:userId>\n                    <rh:orgRole>UNAUTHENTICATED</rh:orgRole>\n                    <rh:appRole>QA-Test</rh:appRole>\n                </rh:userPrincipal>\n                <rh:target>\n                    <rh:serviceName>IndividualBenefits</rh:serviceName>\n                    <rh:serviceOperation>locateBenefits</rh:serviceOperation>\n                </rh:target>\n            </rh:functionalContext>\n        </rh:requestHeader>\n    </soapenv:Header>\n    <soapenv:Body>\n        <ns:locateBenefits>\n            <ns1:locateBenefits>\n                <ns1:customerIdentifiers>\n                    <ns2:customerIdentifier>\n                        <ns2:coverageType>MED</ns2:coverageType>\n                        <ns2:eligibilitySourceSystem>\n                            <ns3:identifier>758244076425288</ns3:identifier>\n                            <ns3:locationCode>CED</ns3:locationCode>\n                        </ns2:eligibilitySourceSystem>\n                        <ns2:claimRoutingSystem>PCLM</ns2:claimRoutingSystem>\n                    </ns2:customerIdentifier>\n                </ns1:customerIdentifiers>\n                <ns1:requestType xsi1:type=\"ns2:BenefitsRequestHIPAAServicesType\" xmlns:xsi1=\"http://www.w3.org/2001/XMLSchema-instance\">\n                    <ns2:hipaaServiceType>\n                        <ns2:coverageType>MED</ns2:coverageType>\n                        <ns2:planLevelBenefitsIndicator>true</ns2:planLevelBenefitsIndicator>\n                        <ns2:hippaServiceTypeCode>30</ns2:hippaServiceTypeCode>\n                        <ns2:childSTCIndicator>true</ns2:childSTCIndicator>\n                    </ns2:hipaaServiceType>\n                </ns1:requestType>\n                <ns1:rangeBandBenefitsCode>All</ns1:rangeBandBenefitsCode>\n                <ns1:includeSensitiveServiceAccumulations>true</ns1:includeSensitiveServiceAccumulations>\n                <ns1:asOfDate>2024-04-19</ns1:asOfDate>\n                 <ns1:includeBenefitMessages>true</ns1:includeBenefitMessages>\n                <ns1:includeCombinedAccumMessages>true</ns1:includeCombinedAccumMessages>\n                <ns1:includeDescriptions>true</ns1:includeDescriptions>\n            </ns1:locateBenefits>\n        </ns:locateBenefits>\n    </soapenv:Body>\n</soapenv:Envelope>
